Revit 2024 API
AdvancedLossFactor Members
The AdvancedLossFactor type exposes the following members.
Constructors
Name | Description
AdvancedLossFactor()
 Creates an advanced loss factor object with values set to no loss.
AdvancedLossFactor(AdvancedLossFactor)
 Creates a copy of the given advanced loss factor object
AdvancedLossFactor(Double, Double, Double, Double, Double, Double, Double)
 Creates an advanced loss factor object with the given values.
Methods
Name | Description
Clone
 Creates a copy of the LossFactor derived object.
 (Inherited from LossFactor.)
Dispose |  (Inherited from LossFactor.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BallastLossFactor
 The ballast loss factor.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from LossFactor.)
LampLumenDepreciation
 The lamp lumen depreciation loss factor.
LampTiltLossFactor
 The lamp tilt loss factor.
LossFactorValue
 The calculated loss factor value
 (Inherited from LossFactor.)
LuminaireDirtDepreciation
 The luminaire dirt depreciation loss factor.
SurfaceDepreciationLossFactor
 The surface depreciation loss factor.
TemperatureLossFactor
 The temperature loss factor.
VoltageLossFactor
 The voltage loss factor.
See Also
AdvancedLossFactor Class
Autodesk.Revit.DB.Lighting Namespace